Services/structuralAnalysis/Structural_Analysis.resize.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:str">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:resize>
   <InputMatFilename></InputMatFilename>
   <dstRows>0</dstRows>
   <dstCols>0</dstCols>
   <fx-D>0.000000</fx-D>
   <fy-D>0.000000</fy-D>
   <interpolation-D></interpolation-D>
  </ns:resize>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
